cuongh1799/NUVOTON-NUC140-PROJECT/Question3/main.c

#include <stdio.h>
#include "NUC100Series.h"
#include "LCD.h"
#include <stdint.h>
#include <math.h>
#include <stdbool.h>
#include <string.h>
#include "MCU_init.h"
#include "SYS_init.h"

#define TMR0_COUNTS 100000
#define HXT_STATUS 1<<0
#define PLL_STATUS 1<<2
volatile bool buzzFlag = false;					// Buzzer ON/OFF
#define BUZZER_BEEP_TIME 10					   // Beep Time
#define BUZZER_BEEP_DELAY 300000 
void Buzzer_beep(int beep_time);
void SPI3_config(void); // for the LCD
void System_config(void);
void LCD_start(void);
void LCD_command(unsigned char temp);
void LCD_data(unsigned char temp);
void LCD_clear(void);
void LCD_SetAddress(uint8_t PageAddr, uint8_t ColumnAddr);
void SPI2_TX(unsigned char temp);
void UART02_IRQHandler(void);
void UART0_Init(void);
int byteToInt(unsigned char byte);

void clr_segment(void);
void show_segment(unsigned char n, unsigned char number);
void TIMER0_Config(void);
static int TimePassed = 0;			// for tmr interrupt
void GPIO_Config(void);

void checkState(int state);
int getMatrixKey(void);
void ScanAndDisplay(void);
void hitScan(void); // scan if hit
void appendChar(char *str, char c);
void LoadMap(void);
static bool mapLoaded = false;
static bool alreadyBeep = false;


int countShipSpot(void);
static int WinCon = 0;
static char WinCon_ch[4] = "0000"; 

extern unsigned char amogus[32*32] = {
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,
0xE0,0xF0,0xF0,0xF8,0xF8,0xF8,0xF8,0xFE,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xF3,0xF3,0xE3,0xE3,0xE1,0xE1,0xE1,0xE3,0xE3,0xE3,0xE3,0xE2,0xF4,0xBC,0x18,
0x07,0x1F,0x1F,0x1F,0x1F,0x1F,0x3F,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0x3F,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0x1F,0x03,0x00,
0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x01,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x01,0x01,0x01,0x01,0x01,0x00};

static int shots = 15;
static char shots_ch[4] = "0000";

/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------MAP VARIABLE-----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------
`map_display` is the map that shows on the LCDs
`map_ship` is the map that is use for scanning the hits
when hits, change the hit spot to 1 in the `map_display`
*/


static int indexX = 0;
static int indexY = 0;	
static bool uploadStatus = false;
static char receivedData;
static bool UART0_FLAG = 0;
	
static int map_display[8][8]={
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0}
};


static int uploadIndex= 0;
static char dataFromUART[8][8]; 

static int map_ship[8][8]={
{1,0,0,0,0,0,0,0},
{1,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0}
};

static int score = 0;
static char score_ch[1] = "0";

/*
0 = menu
1 = map (playing)
2 = end
*/
static int state = 0;
static char state_ch[4] = "0000";
static int mapRow = 2;
static int mapCol = 0;

/*
BECAUSE IN THE GAMEPLAY, WE SEE THE COLUMN AND ROW STARTS WITH `1`
HOWEVER, IN THE SYSTEM ARRAY `map_ship` AND `map_display` THE COLUMN AND ROW STARTS WITH 0
THEREFORE WHEN HITSCAN THE COORDINATE, WE NEED TO -1 BOTH OF THE COORDINATE, HENCE THE STARTING POSITION IS 1 INSTEAD 0
*/

static int currentX = 1; // To show the user current x or y
static int currentY = 1;
static char currentX_ch[1] = "1";
static char currentY_ch[1] = "1";

static int bullets = 0;

/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------KEYPRESS MATRIX-----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

static int keypress; // to store the matrix 3x3 key presses
static char keypress_ch[4] = "0000";
static int coordinateMode = 0; // x for 0, y for 1
static char coordinateModeName[2][2] = {"X", "Y"};
static int coordinateFlag = 3; // represent the 7segment position

/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------TIMER------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

static int segmentBit = 0;

/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------MAIN-------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
int main(){
	
	System_config();
	SPI3_config();
	
	LCD_start();
	LCD_clear();
	GPIO_Config();
	UART0_Init();
	
	PB->PMD &= (~(0x03<<30)); // enable GPB15 (the button)
	
	PC->DOUT |= (1<<7);     
	PC->DOUT &= ~(1<<6);		
	PC->DOUT &= ~(1<<5);		
	PC->DOUT &= ~(1<<4);	

	TIMER0_Config();
	
	while(1){	
		WinCon = countShipSpot();
		sprintf(WinCon_ch, "%d", countShipSpot());		
		ScanAndDisplay();
		checkState(state);
		CLK_SysTickDelay(1000);
	}
}

