cuongh1799/NUVOTON-NUC140-PROJECT/Question3/main.c
/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------CLOCK CONFIG-----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

void System_config(void){
	SYS_UnlockReg(); // Unlock protected registers
	
	CLK->PWRCON |= (1 << 0);
  while(!(CLK->CLKSTATUS & HXT_STATUS));
	//PLL configuration starts
	CLK->PLLCON &= ~(1 << 19); //0: PLL input is HXT
	CLK->PLLCON &= ~(1 << 16); //PLL in normal mode
	CLK->PLLCON &= (~(0x01FF << 0));
	CLK->PLLCON |= 48;
	CLK->PLLCON &= ~(1 << 18); //0: enable PLLOUT
	while(!(CLK->CLKSTATUS & PLL_STATUS));
	//PLL configuration ends
	
	//clock source selection
	CLK->CLKSEL0 &= (~(0x07 << 0));
	CLK->CLKSEL0 |= (0x02 << 0);
	//clock frequency division
	CLK->CLKDIV &= (~0x0F << 0);
	
	// SPI3 clock enable
	CLK->APBCLK |= 1 << 15;
	
	/*
	//ADC Clock selection and configuration
	CLK->CLKSEL1 &= ~(0x03 << 2); // ADC clock source is 12 MHz
	CLK->CLKDIV &= ~(0x0FF << 16);
	CLK->CLKDIV |= (0x0B << 16); // ADC clock divider is (11+1) --> ADC clock is 12/12 = 1 MHz
	CLK->APBCLK |= (0x01 << 28); // enable ADC clock
	*/
	
	//UART0 Clock selection and configuration
	CLK->CLKSEL1 &= ~(0b11 << 24);
	CLK->CLKSEL1 |= (0b11 << 24); // 22. something
	//CLK->CLKSEL1 |= (0b01 << 24); // UART0 clock source is PLLsource
	CLK->CLKDIV &= ~(0xF << 8); // clock divider is 1
	CLK->APBCLK |= (1 << 16); // enable UART0 clock
	
	SYS_LockReg();  // Lock protected registers 
}

/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------UART0 config-----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

void UART0_Init(void) {
	// UART0 pin configuration. PB.1 pin is for UART0 TX
	PB->PMD &= ~(0b11 << 2);
	PB->PMD |= (0b01 << 2); // PB.1 is output pin
	SYS->GPB_MFP |= (1 << 1); // GPB_MFP[1] = 1 -> PB.1 is UART0 TX pin
	
	SYS->GPB_MFP |= (1 << 0); // GPB_MFP[0] = 1 -> PB.0 is UART0 RX pin	
	PB->PMD &= ~(0b11 << 0);	// Set Pin Mode for GPB.0(RX - Input)

	// UART0 operation configuration
	UART0->LCR |= (0b11 << 0); // 8 data bit
	UART0->LCR &= ~(1 << 2); // one stop bit	
	UART0->LCR &= ~(1 << 3); // no parity bit
	UART0->FCR |= (1 << 1); // clear RX FIFO
	UART0->FCR |= (1 << 2); // clear TX FIFO
	UART0->FCR &= ~(0xF << 16); // FIFO Trigger Level is 1 byte]
	
	//Baud rate config: BRD/A = 1, DIV_X_EN=0
	//--> Mode 0, Baud rate = UART_CLK/[16*(A+2)] = 22.1184 MHz/[16*(1+2)]= 115200 bps
	UART0->BAUD &= ~(0b11 << 28); // mode 0	
	UART0->BAUD &= ~(0xFFFF << 0);
	UART0->BAUD |= 10;
    
	// Enable UART0 receive interrupt
	UART0->IER |= 1 << 0;
	
	// Enable NVIC UART0 IRQ
	//NVIC_EnableIRQ(UART02_IRQn);
	NVIC->ISER[0] |= 1 << 12;
}

/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-------------------------Timer0 configuration-----------------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

void TIMER0_Config(void){
	CLK->CLKSEL1 &= ~(0x111 << 8);	
	CLK->CLKSEL1 |= (0b010 << 8);			// 12MHz
	CLK->APBCLK |= (1 << 2);					// enable timer0
	// Set prescaler
	TIMER0->TCSR &= ~(0xFF << 0);			// reset timer0
	// Opearting mode
	TIMER0->TCSR |= (1 << 26);				// Reset Timer0
	TIMER0->TCSR &= ~(0b11 << 27);		// one-shot mode
	TIMER0->TCSR |= (0b01 << 27);			// timer operate at periodic mode
	TIMER0->TCSR &= ~(1 << 24);			  // no effect
	//TIMER0->TCSR |= (1 << 16);				// TDR is updated continuously while counter is counting
	// Value
	TIMER0->TCMPR = TMR0_COUNTS;			// 
	TIMER0->TCSR |= (1 << 29);				// Enable timer interrupt flag TIF	
	TIMER0->TCSR |= (1 << 30);				// Start counting
	
	//Set Timer0 in NVIC Set-Enable Control Register (NVIC_ISER)
	NVIC->ISER[0] |= 1 << 8;
	// CONFIG CLOCK, OPERATING MODE, AND VALUE FOR TIMER0 ENDS-------
}

// Timer0 interrupt - for time transition each 7Segment LED to avoid bouncing
void TMR0_IRQHandler(void){

	clr_segment(); 
	TIMER0->TISR |= (1<<0);		// generate interrupt

	switch(segmentBit){
		case 0:
			if(bullets < 10){
				show_segment(0, bullets);
			}
			else if(bullets >= 10 && bullets < 16){
				show_segment(0, bullets % 10);
			}
			segmentBit++;
			break;
		case 1:
			clr_segment();
			if(bullets >= 10){
				show_segment(1, 1);
			}
			segmentBit++;
			break;
		case 2:
			clr_segment();
			if(coordinateMode == 0){
				show_segment(coordinateFlag ,currentX);
			}
			else if(coordinateMode == 1){
				PE->DOUT |= (1<<7);		//segment g
				PE->DOUT |= (1<<5);		//segment d
				PE->DOUT |= (1<<4);	//segment b
				PE->DOUT |= (1<<3);		//segment a
				PE->DOUT |= (1<<2);		//segment f
				PE->DOUT |= (1<<1);	//DOT
				PE->DOUT |= (1<<0);		// segment c
			}
			segmentBit++;
			break;
		case 3:
			clr_segment();
			if(coordinateMode == 1){
				show_segment(coordinateFlag ,currentY);
			}
			else if(coordinateMode == 0){
				PE->DOUT |= (1<<7);		//segment g
				PE->DOUT |= (1<<5);		//segment d
				PE->DOUT |= (1<<4);	//segment b
				PE->DOUT |= (1<<3);		//segment a
				PE->DOUT |= (1<<2);		//segment f
				PE->DOUT |= (1<<1);	//DOT
				PE->DOUT |= (1<<0);		// segment c
			}
			segmentBit = 0;
			break;
	}
	
