cuongh1799/NUVOTON-NUC140-PROJECT/Question3/main.c
	TIMER0->TISR |= (1<<0);		// Clear the flag by writing 1 to it
}


/*
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------SPI3--------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

void SPI3_config(void){

	SYS->GPD_MFP |= 1 << 11; //1: PD11 is configured for alternative function
	SYS->GPD_MFP |= 1 << 9; //1: PD9 is configured for alternative function
	SYS->GPD_MFP |= 1 << 8; //1: PD8 is configured for alternative function

	SPI3->CNTRL &= ~(1 << 23); //0: disable variable clock feature
	SPI3->CNTRL &= ~(1 << 22); //0: disable two bits transfer mode
	SPI3->CNTRL &= ~(1 << 18); //0: select Master mode
	SPI3->CNTRL &= ~(1 << 17); //0: disable SPI interrupt

	SPI3->CNTRL |= 1 << 11; //1: SPI clock idle high
	SPI3->CNTRL &= ~(1 << 10); //0: MSB is sent first
	SPI3->CNTRL &= ~(0b11 << 8); //00: one transmit/receive word will be executed in one data transfer
	SPI3->CNTRL &= ~(0b11111 << 3);
	SPI3->CNTRL |= 9 << 3; //9 bits/word
	SPI3->CNTRL &= ~(1 << 2);  //1: Transmit at positive edge of SPI CLK

	SPI3->DIVIDER = 24; // SPI clock divider. SPI clock = HCLK / ((DIVIDER+1)*2)
}

/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------LCD---------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

void LCD_start(void)
{
	LCD_command(0xE2); // Set system reset
	LCD_command(0xA1); // Set Frame rate 100 fps  
	LCD_command(0xEB); // Set LCD bias ratio E8~EB for 6~9 (min~max)  
	LCD_command(0x81); // Set V BIAS potentiometer
	LCD_command(0xA0); // Set V BIAS potentiometer: A0 ()        	
	LCD_command(0xC0);
	LCD_command(0xAF); // Set Display Enable
}

void LCD_command(unsigned char temp)
{
	SPI3->SSR |= 1 << 0;
	SPI3->TX[0] = temp;
	SPI3->CNTRL |= 1 << 0;
	while (SPI3->CNTRL & (1 << 0));
	SPI3->SSR &= ~(1 << 0);
}

void LCD_data(unsigned char temp)
{
	SPI3->SSR |= 1 << 0;
	SPI3->TX[0] = 0x0100 + temp;
	SPI3->CNTRL |= 1 << 0;
	while (SPI3->CNTRL & (1 << 0));
	SPI3->SSR &= ~(1 << 0);
}

void LCD_clear(void)
{
	int16_t i;
	LCD_SetAddress(0x0, 0x0);
	for (i = 0; i < 132 * 8; i++)
	{
		LCD_data(0x00);
	}
}

void LCD_SetAddress(uint8_t PageAddr, uint8_t ColumnAddr)
{
	LCD_command(0xB0 | PageAddr);
	LCD_command(0x10 | (ColumnAddr >> 4) & 0xF);
	LCD_command(0x00 | (ColumnAddr & 0xF));
}

/*
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------7SEGMENT-----------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
void clr_segment(void)
{
	unsigned char i;
	for(i=0; i<4; i++)
	{
		PC->DOUT &= ~(1<<(4+i));
	}
}
 
void show_segment(unsigned char n, unsigned char number)
{
	unsigned char i;
	unsigned char number__[10] = {0x82 ,0xEE, 0x07, 0x46, 0x6A, 0x52, 0x12, 0xE6, 0x02, 0x62};
	for(i=0; i<8; i++)
	{
		if((number__[number]&0x01)==0x01)
		PE->DOUT |= (1<<i);
		else
		PE->DOUT &= ~(1<<i);
		number__[number]=number__[number]>>1;
	}
	PC->DOUT |= (1<<(4+n));
}

void ScanAndDisplay(void){
		keypress = getMatrixKey();
		
		if(keypress == 9){
			/*
			0 = x
			1 = y
			*/
			if(coordinateMode == 0){
				coordinateMode = 1;
				coordinateFlag = 2;
				clr_segment();
				CLK_SysTickDelay(4500);
				//show_segment(coordinateFlag ,0);
			}
			else if(coordinateMode == 1){
				coordinateMode = 0;
				coordinateFlag = 3;
				clr_segment();
				CLK_SysTickDelay(4500);
				//show_segment(coordinateFlag ,0);
			}
		}
		if(keypress != 0 && keypress != 9){
			//keypress = lastkeypress;
			clr_segment();
			//show_segment(coordinateFlag ,keypress);
			if(coordinateMode == 0){
				currentX = keypress;
				sprintf(currentX_ch, "%d", currentX);
			}
			else if(coordinateMode == 1){
				currentY = keypress;
				sprintf(currentY_ch, "%d", currentY);
			}
		}
}

/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-------------------------------GPB15 AND KEYMATRIX------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
void GPIO_Config(void)	{
	// SET PA 0-2 TO INPUT PULL UP (IMPORTANT), 3-5 TO OUTPUT
	/*
	PA->PMD &= (~(0x03 << 0)); 
	PA->PMD &= (~(0x03 << 2)); 
	PA->PMD &= (~(0x03 << 4)); 
	
	PA->PMD &= (~(0x03 << 6)); // 3
	PA->PMD &= (~(0x03 << 8)); // 4
	PA->PMD &= (~(0x03 << 10)); // 5
	PA->PMD &= ((0x01 << 6));
	PA->PMD &= ((0x01 << 8));
	PA->PMD &= ((0x01 << 10));
	*/
	PB->PMD &= ~(0x03<<22);	
	PB->PMD |= (0x01<<22);
	
	GPIO_SetMode(PA, BIT0, GPIO_MODE_QUASI);
	GPIO_SetMode(PA, BIT1, GPIO_MODE_QUASI);
	GPIO_SetMode(PA, BIT2, GPIO_MODE_QUASI);
	GPIO_SetMode(PA, BIT3, GPIO_MODE_QUASI);
	GPIO_SetMode(PA, BIT4, GPIO_MODE_QUASI);
	GPIO_SetMode(PA, BIT5, GPIO_MODE_QUASI);
	
