cuongh1799/NUVOTON-NUC140-PROJECT/Question3/main.c
	PC->PMD &= (~(0x03 << 12)); // LED hit
	PC->PMD |= (0x01 << 12); // LED hit
	
	PB->PMD &= (~(0x03 << 30)); // Input
	PB->IMD &= (~(1 << 15)); // Detect edge-trigger interrupt 
	PB->IEN |= (1 << 15); // falling edge-trigger
	
	NVIC->ISER[0] |= 1 << 3; // Turn on interrupt
	NVIC->IP[0] &= (~(3 << 30)); // Set priority
	
	// Debounce configuration
	PB->DBEN |= (1<<15); // Initial Debounce
	PA->DBEN |= (1<<0); // Initial Debounce
	PA->DBEN |= (1<<2); // Initial Debounce
	PA->DBEN |= (1<<4); // Initial Debounce
	PA->DBEN |= (1<<6); // Initial Debounce
	PA->DBEN |= (1<<8); // Initial Debounce
	PA->DBEN |= (1<<10); // Initial Debounce
	GPIO->DBNCECON &= ~(0xF << 0);
	GPIO->DBNCECON |= (0b0111 << 0); // Sample interrupt input once per 128 clocks: 12MHz/128 = 93.75kHz
	GPIO->DBNCECON |= (1<<4); // Debounce counter clock source is the internal 10kHz low speed oscillator 
	
}

int getMatrixKey(void){
	/*
	The idea of this is to scan the rows and column
	*/
		PA0 = 1; PA1 = 1; PA2 = 0; PA3 = 1; PA4 = 1; PA5 = 1;
	if (PA3 == 0) return 1;
	if (PA4 == 0) return 4;
	if (PA5 == 0) return 7;
	PA0 = 1; PA1 = 0; PA2 = 1; PA3 = 1; PA4 = 1; PA5 = 1;
	if (PA3 == 0) return 2;
	if (PA4 == 0) return 5;
	if (PA5 == 0) return 8;
	PA0 = 0; PA1 = 1; PA2 = 1; PA3 = 1; PA4 = 1; PA5 = 1;
	if (PA3 == 0) return 3;
	if (PA4 == 0) return 6;
	if (PA5 == 0) return 9;
	return 0;
}
/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-------------------------------------INTERRUPT & SHOOTING & MAP LOADING----------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/

void EINT1_IRQHandler(void) {

	switch(state){
		case 0:
			state = 1;
			LCD_clear();
			break;
		case 1:
			if(bullets >= 16){
				state = 3;
				break;
			}
			if(bullets < 16){
				hitScan();
				bullets++;
				if(score == WinCon){
					state = 2;
				}
				
				break;
			}
			
	}
	
	PB->ISRC |= (1 << 15);
}

void hitScan(void){
	if(map_ship[currentY-1][currentX-1] == 1){
		// Check if the position on `map_display` already changed/shot before
		if(map_display[currentY-1][currentX-1] != 1){
			map_display[currentY-1][currentX-1] = 1;
			score++;
			sprintf(score_ch, "%d", score);
			for(int i = 0; i < 6; i++){
				CLK_SysTickDelay(10000);
				PC->DOUT ^= 1 << 12; // Toggle LED5 (GPC12)
			}
			// Flash LED5 three times
			for(int i = 0; i < 3; i++) {
				CLK_SysTickDelay(500000); // Delay for half a second
				PC->DOUT ^= 1 << 12; // Toggle LED5 (GPC12)
				CLK_SysTickDelay(500000); // Delay for half a second
				PC->DOUT ^= 1 << 12; // Toggle LED5 (GPC12)
			}
		}
	}
}

void UART02_IRQHandler(void) {

	  
    // Check if interrupt is caused by received data available
    if (UART0->ISR & 1 << 8) {
			// Get data from RBR (Receive Buffer Register)
			receivedData = UART0->RBR;
			/*
			for (int i = 7; i >= 0; i--) {
					uint8_t digit = (receivedData >> i) & 0b00000001;
					map_display[dataCount][7-i] = digit;
					printf("%d ", digit);
			}
			*/
			UART0->THR = receivedData;
    }
		UART0_FLAG = 1;
    // Clear the interrupt flags
    UART0->ISR = ~(1 << 8);
}

void LoadMap(void){	
	if(UART0_FLAG == 1){
				if (receivedData != ' ' && receivedData != '\n' && receivedData != '\r' && receivedData != '\t') {
		if (receivedData == '1') {
				map_display[indexY][indexX] = 1;
		} else {
				map_display[indexY][indexX] = 0;
		}
		indexX++;
		if (indexX == 8) {
			indexX = 0;
			indexY++;
		}
		if (indexY == 8) {
			uploadStatus = TRUE;
			clear_LCD () ;
		}
	}
		UART0_FLAG = 0;
	}

}

/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-------------------------------GAMELOGIC----------------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
int countShipSpot(void){
	int counting = 0;
	for (int i=0; i<8;i++){
		for (int j=0; j<8;j++){
			if(map_ship[i][j] == 1){
				counting++;
			}
		}
	}
	return counting;
}

void checkState(int state){
	if(state == 0){
		goto menu;
	}
	else if(state == 1){
		//if(!mapLoaded){
			//LoadMap();
			//mapLoaded = true;
		//}

		goto map;
	}
	else if(state == 2){
		goto win;
	}
	else if(state == 3){
		goto lose;
	}

	menu:
				printS_5x7(4, 10, "Battleship");
				printS_5x7(4, 18, "By hehe");
				//printS_5x7(100, 26, state_ch);
				draw_Bmp32x32(4, 30, 1, 0, amogus); 
				CLK_SysTickDelay(1000000);
				return;
	
	map:
	/*
	FOR TESTING THESE ARE FOR DEBUGGING
	*/
	/*
	printS_5x7(2, 5,  dataFromUART[0]);
	printS_5x7(2, 10, dataFromUART[1]);
	printS_5x7(2, 15, dataFromUART[2]);
	printS_5x7(2, 20, dataFromUART[3]);
	printS_5x7(2, 25, dataFromUART[4]);
	printS_5x7(2, 30, dataFromUART[5]);
	printS_5x7(2, 35, dataFromUART[6]);
	printS_5x7(2, 40, dataFromUART[7]);
	printS_5x7(2, 45, "meowmeo");
	*/
	
		
		printS_5x7(67, 20, "Score:");
		printS_5x7(100, 20, score_ch);
	
		printS_5x7(67, 32, "Current x:");
		printS_5x7(120, 32, currentX_ch);
	
		printS_5x7(67, 40, "Current y:");
		printS_5x7(120, 40, currentY_ch);
	
		for (int i=0; i<8;i++){
			for (int j=0; j<8;j++)
			{
				if (map_display[i][j] == 0) {
					printS_5x7(mapRow, mapCol, "-");	// Display "0" = "-"
				}
				else if(map_display[i][j] == 1){
					printS_5x7(mapRow, mapCol, "x");	// Display "1" = "X"
				}
				mapRow = mapRow+8;
			}
			mapCol = mapCol+8;
			mapRow = 2;
		}
		
		return;
		
	win:
		CLK_SysTickDelay(10000);
		clear_LCD();
		clr_segment();
		printS_5x7(20, 32, "gg you win");
		return;
	lose:
		CLK_SysTickDelay(10000);
		clear_LCD();
		Buzzer_beep(BUZZER_BEEP_TIME);
		clr_segment();
		printS_5x7(20, 32, "gg you lost");
		return;
}

void CharArrToIntArr(int int_array[], char char_array[]){
	for (int i = 0; i < 5; i++) {
        int_array[i] = char_array[i] - '0';
    }
}
void Buzzer_beep(int beep_time){
	if(alreadyBeep == false){
		for (int i=0; i < beep_time; i++){
		PB->DOUT ^= (1<<11);
		CLK_SysTickDelay(BUZZER_BEEP_DELAY);
	}
	alreadyBeep = true;	
	}
}